
#include<bits/stdc++.h>
using namespace std;

typedef vector<long long> vl;
typedef vector<int> vi;

#define all(v)	((v).begin()), ((v).end())
#define sz(v)	((int)((v).size()))
#define ll long long
#define pb push_back
#define nl '\n'
#define yes cout<<"YES\n"
#define no cout<<"NO\n"
#define yesR cout<<"YES\n";return;
#define noR cout<<"NO\n";return;
#define vit vector<int>::iterator  
#define forcin(n) for(auto &x : n) cin>>x;
#define forcout(n) for(auto x : n) cout << x << " ";
void printVec(vector<int> v2, string s = "")//vector ke print kore just printVec(v) likle hobe
{
	cout<<s;
	for (int i = 0; i < (int)v2.size(); ++i)
			cout<<v2[i]<<" ";
		cout<<"\n";
}
/*        ／＞　　フ
　　　　　| 　_　 _ |
　 　　　／` ミ＿Yノ     meow
　　 　 /　　　 　 |   
　　　 /　 ヽ　　 ﾉ  
　 　 │　　|　|　|
　／￣|　　 |　|　|    
　| (￣ヽ＿_ヽ_)__)   
　＼二つ
*/

void solve()
{
    ll a , b, x;
    cin >> a >> b >> x;
    if(x % 3 == 0)
    {
        cout << (a ^ b) << nl;
    }
    else if( x % 3 == 1)
    {
        cout << (a^0) << nl;
    }
    else if(x % 3 == 2)
    {
        cout << (0 ^ b) << nl;
    }
    //kemne je pai gesi connection ,shaaaantiiii...now i can sleep in peace...


}

int main(){
    int t=1;
    //cin >> t;          // remove '//' for testcase
    while(t--){
        solve();
    }
    return 0;
}


/*⠀⠀⠀⠀⠀⠀⠀⠀⠀✦⠀
　　　　　　.　　　ﾟ .　　　　　. 　　　✦ 　　　　　,　　　　　　　.
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀☁️
　　　　　　*　　　　　　　　　　　.
.　　　　　　　　　　　　　. 　　✦⠀ 　　　,　　　　　　　　　*
　　　　　　⠀　　,
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀. 　　⠀　　　.　　　　　　　.
　　　　.  ／＞　　フ
　  　　　| 　_　 _ |
　 　　　／` ミ＿Yノ     meow        ☁️ 
　　 　 /　　　 　 |         ﾟ .
　　　 /　 ヽ　　 ﾉ       ,       ,
　 　 │　　|　|　|           ✦       ,     ✦  
　／￣|　　 |　|　|        
　| (￣ヽ＿_ヽ_)__)     🗡  
　＼二つ⠀.　                     ✦
　　˚　　　⠀　⠀ 　　
.　　　　⠀⠀⠀✦ ⠀ ⠀　　　　　⠀* ⠀⠀⠀.　　　　　. ⠀⠀⠀⠀⠀⠀✦⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀ ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀🕷 ⠀ ⠀⠀⠀⠀⠀⠀.　　　　　　　　　　　　　.　　　ﾟ .　　　　　　　　　　　　　. 　　　　　　　　　　　　　　　✦ 　　　　♡ ㅤ ❍ㅤ ⎙ㅤ ⌲
,　　　　　　　.
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀☁️
　　　　　　*　　　　　　　　　　　.

　　　　　　　　　　　.
　　　　　　　🗡
　　　˚　　　　　　　　ﾟ　　　　　.
　.⠀　　🗝⠀‍⠀‍⠀‍⠀‍⠀‍⠀‍⠀‍⠀‍⠀‍⠀‍⠀,
　　　*　　⠀.


*/
